# SectionNameKey Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..SectionNameKey Property
StructuralSection Class See Also
---
A parameter in structural families which allows for family type identification. This will be used for data mapping during model exchange with another program, namely Advance Steel.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string SectionNameKey { get; set; }
```

Visual Basic
---
```text
Public Property SectionNameKey As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SectionNameKey {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace